<?php
$data = [
    '山田太郎' => ['性別' => '男',    '生年月日' => '1989-12-12', '住所' => '北海道'],
    '横山花子' => ['性別' => '女',    '生年月日' => '1997-07-23', '住所' => '山形県'],
    '田中一郎' => ['性別' => '男',    '生年月日' => '1971-04-08', '住所' => '東京都'],
    '山本久美子' => ['生年月日' => '1989-08-05', '住所' => '静岡県', '性別' => '女'],
    '鈴木次郎' => ['性別' => '男',    '生年月日' => '2001-01-18', '住所' => '富山県'],
    '星山裕子' => ['性別' => 'その他','生年月日' => '1982-07-22', '住所' => '岡山県'],
    '佐藤勝男' => ['性別' => '男',    '住所' => '高知県'],
];

print('<dl>');
foreach($data as $name => $prof) {
    print('<dt>' . $name . '</dt>');
    print('<dd>性別: ' . $prof['性別'] . '</dd>');
    print('<dd>生年月日: ' . $prof['生年月日'] . '</dd>');
    print('<dd>住所: ' . $prof['住所'] . '</dd>');
}
print('</dl>');